TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                        Unix v18.12.4.LTS *
       3                    ;* Date/Time created: Mon Jan 27 17:24:52 2020                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wifi/sln
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v18.12.4.LTS Copyright (c) 1
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wifi
      13                            .global SlNetIfConfigWifi

    7209                            .dwattr $C$DW$664, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetsock.
    7210                            .dwattr $C$DW$664, DW_AT_decl_line(0x136)
    7211                            .dwattr $C$DW$664, DW_AT_decl_column(0x05)
    7212                    
    7213                    $C$DW$665       .dwtag  DW_TAG_enumerator
    7214                            .dwattr $C$DW$665, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
    7215                            .dwattr $C$DW$665, DW_AT_const_value(0x04)
    7216                            .dwattr $C$DW$665, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetsock.
    7217                            .dwattr $C$DW$665, DW_AT_decl_line(0x137)
    7218                            .dwattr $C$DW$665, DW_AT_decl_column(0x05)
    7219                    
    7220                    $C$DW$666       .dwtag  DW_TAG_enumerator
    7221                            .dwattr $C$DW$666, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
    7222                            .dwattr $C$DW$666, DW_AT_const_value(0x05)
    7223                            .dwattr $C$DW$666, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetsock.
    7224                            .dwattr $C$DW$666, DW_AT_decl_line(0x138)
    7225                            .dwattr $C$DW$666, DW_AT_decl_column(0x05)
    7226                    
    7227                    $C$DW$667       .dwtag  DW_TAG_enumerator
    7228                            .dwattr $C$DW$667, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
    7229                            .dwattr $C$DW$667, DW_AT_const_value(0x06)
    7230                            .dwattr $C$DW$667, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetsock.
    7231                            .dwattr $C$DW$667, DW_AT_decl_line(0x139)
    7232                            .dwattr $C$DW$667, DW_AT_decl_column(0x05)
    7233                    
    7234                            .dwattr $C$DW$T$560, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetsoc
    7235                            .dwattr $C$DW$T$560, DW_AT_decl_line(0x133)
    7236                            .dwattr $C$DW$T$560, DW_AT_decl_column(0x01)
    7237                            .dwendtag $C$DW$T$560
    7238                    
    7239                    $C$DW$T$561     .dwtag  DW_TAG_typedef
    7240                            .dwattr $C$DW$T$561, DW_AT_name("SlNetSockTxInhibitThreshold_e")
    7241                            .dwattr $C$DW$T$561, DW_AT_type(*$C$DW$T$560)
    7242                            .dwattr $C$DW$T$561, DW_AT_language(DW_LANG_C)
    7243                            .dwattr $C$DW$T$561, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetsoc
    7244                            .dwattr $C$DW$T$561, DW_AT_decl_line(0x13a)
    7245                            .dwattr $C$DW$T$561, DW_AT_decl_column(0x03)
    7246                    
    7247                    
    7248                    $C$DW$T$562     .dwtag  DW_TAG_enumeration_type
    7249                            .dwattr $C$DW$T$562, DW_AT_byte_size(0x01)
    7250                    $C$DW$668       .dwtag  DW_TAG_enumerator
    7251                            .dwattr $C$DW$668, DW_AT_name("SLNETIF_STATE_DISABLE")
    7252                            .dwattr $C$DW$668, DW_AT_const_value(0x00)
    7253                            .dwattr $C$DW$668, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetif.h"
    7254                            .dwattr $C$DW$668, DW_AT_decl_line(0x62)
    7255                            .dwattr $C$DW$668, DW_AT_decl_column(0x05)
    7256                    
    7257                    $C$DW$669       .dwtag  DW_TAG_enumerator
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  133

    7258                            .dwattr $C$DW$669, DW_AT_name("SLNETIF_STATE_ENABLE")
    7259                            .dwattr $C$DW$669, DW_AT_const_value(0x01)
    7260                            .dwattr $C$DW$669, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetif.h"
    7261                            .dwattr $C$DW$669, DW_AT_decl_line(0x63)
    7262                            .dwattr $C$DW$669, DW_AT_decl_column(0x05)
    7263                    
    7264                            .dwattr $C$DW$T$562, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetif.
    7265                            .dwattr $C$DW$T$562, DW_AT_decl_line(0x61)
    7266                            .dwattr $C$DW$T$562, DW_AT_decl_column(0x01)
    7267                            .dwendtag $C$DW$T$562
    7268                    
    7269                    $C$DW$T$563     .dwtag  DW_TAG_typedef
    7270                            .dwattr $C$DW$T$563, DW_AT_name("SlNetIfState_e")
    7271                            .dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$562)
    7272                            .dwattr $C$DW$T$563, DW_AT_language(DW_LANG_C)
    7273                            .dwattr $C$DW$T$563, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/net/slnetif.
    7274                            .dwattr $C$DW$T$563, DW_AT_decl_line(0x64)
    7275                            .dwattr $C$DW$T$563, DW_AT_decl_column(0x03)
    7276                    
    7277                    
    7278                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7279                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x28)
    7280                    $C$DW$670       .dwtag  DW_TAG_member
    7281                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$6)
    7282                            .dwattr $C$DW$670, DW_AT_name("SsidLen")
    7283                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("SsidLen")
    7284                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7285                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7286                            .dwattr $C$DW$670, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7287                            .dwattr $C$DW$670, DW_AT_decl_line(0x243)
    7288                            .dwattr $C$DW$670, DW_AT_decl_column(0x0d)
    7289                    
    7290                    $C$DW$671       .dwtag  DW_TAG_member
    7291                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$23)
    7292                            .dwattr $C$DW$671, DW_AT_name("SsidName")
    7293                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("SsidName")
    7294                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7295                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7296                            .dwattr $C$DW$671, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7297                            .dwattr $C$DW$671, DW_AT_decl_line(0x244)
    7298                            .dwattr $C$DW$671, DW_AT_decl_column(0x0d)
    7299                    
    7300                    $C$DW$672       .dwtag  DW_TAG_member
    7301                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    7302                            .dwattr $C$DW$672, DW_AT_name("Bssid")
    7303                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("Bssid")
    7304                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7305                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7306                            .dwattr $C$DW$672, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7307                            .dwattr $C$DW$672, DW_AT_decl_line(0x245)
    7308                            .dwattr $C$DW$672, DW_AT_decl_column(0x0d)
    7309                    
    7310                    $C$DW$673       .dwtag  DW_TAG_member
    7311                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$6)
    7312                            .dwattr $C$DW$673, DW_AT_name("Padding")
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  134

    7313                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("Padding")
    7314                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7315                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7316                            .dwattr $C$DW$673, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7317                            .dwattr $C$DW$673, DW_AT_decl_line(0x246)
    7318                            .dwattr $C$DW$673, DW_AT_decl_column(0x0d)
    7319                    
    7320                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7321                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x242)
    7322                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    7323                            .dwendtag $C$DW$T$25
    7324                    
    7325                    $C$DW$T$243     .dwtag  DW_TAG_typedef
    7326                            .dwattr $C$DW$T$243, DW_AT_name("SlWlanEventConnect_t")
    7327                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$25)
    7328                            .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    7329                            .dwattr $C$DW$T$243, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7330                            .dwattr $C$DW$T$243, DW_AT_decl_line(0x247)
    7331                            .dwattr $C$DW$T$243, DW_AT_decl_column(0x03)
    7332                    
    7333                    
    7334                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7335                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x4c)
    7336                    $C$DW$674       .dwtag  DW_TAG_member
    7337                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$6)
    7338                            .dwattr $C$DW$674, DW_AT_name("SsidLen")
    7339                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("SsidLen")
    7340                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7341                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7342                            .dwattr $C$DW$674, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7343                            .dwattr $C$DW$674, DW_AT_decl_line(0x25a)
    7344                            .dwattr $C$DW$674, DW_AT_decl_column(0x0d)
    7345                    
    7346                    $C$DW$675       .dwtag  DW_TAG_member
    7347                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    7348                            .dwattr $C$DW$675, DW_AT_name("SsidName")
    7349                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("SsidName")
    7350                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7351                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7352                            .dwattr $C$DW$675, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7353                            .dwattr $C$DW$675, DW_AT_decl_line(0x25b)
    7354                            .dwattr $C$DW$675, DW_AT_decl_column(0x0d)
    7355                    
    7356                    $C$DW$676       .dwtag  DW_TAG_member
    7357                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    7358                            .dwattr $C$DW$676, DW_AT_name("Bssid")
    7359                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("Bssid")
    7360                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7361                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7362                            .dwattr $C$DW$676, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7363                            .dwattr $C$DW$676, DW_AT_decl_line(0x25c)
    7364                            .dwattr $C$DW$676, DW_AT_decl_column(0x0d)
    7365                    
    7366                    $C$DW$677       .dwtag  DW_TAG_member
    7367                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  135

    7368                            .dwattr $C$DW$677, DW_AT_name("Reserved")
    7369                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("Reserved")
    7370                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7371                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7372                            .dwattr $C$DW$677, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7373                            .dwattr $C$DW$677, DW_AT_decl_line(0x25d)
    7374                            .dwattr $C$DW$677, DW_AT_decl_column(0x0d)
    7375                    
    7376                    $C$DW$678       .dwtag  DW_TAG_member
    7377                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$6)
    7378                            .dwattr $C$DW$678, DW_AT_name("GoDeviceNameLen")
    7379                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("GoDeviceNameLen")
    7380                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7381                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7382                            .dwattr $C$DW$678, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7383                            .dwattr $C$DW$678, DW_AT_decl_line(0x25e)
    7384                            .dwattr $C$DW$678, DW_AT_decl_column(0x0d)
    7385                    
    7386                    $C$DW$679       .dwtag  DW_TAG_member
    7387                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    7388                            .dwattr $C$DW$679, DW_AT_name("GoDeviceName")
    7389                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("GoDeviceName")
    7390                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7391                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7392                            .dwattr $C$DW$679, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7393                            .dwattr $C$DW$679, DW_AT_decl_line(0x25f)
    7394                            .dwattr $C$DW$679, DW_AT_decl_column(0x0d)
    7395                    
    7396                    $C$DW$680       .dwtag  DW_TAG_member
    7397                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$26)
    7398                            .dwattr $C$DW$680, DW_AT_name("Padding")
    7399                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("Padding")
    7400                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    7401                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7402                            .dwattr $C$DW$680, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7403                            .dwattr $C$DW$680, DW_AT_decl_line(0x260)
    7404                            .dwattr $C$DW$680, DW_AT_decl_column(0x0d)
    7405                    
    7406                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7407                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x259)
    7408                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    7409                            .dwendtag $C$DW$T$27
    7410                    
    7411                    $C$DW$T$244     .dwtag  DW_TAG_typedef
    7412                            .dwattr $C$DW$T$244, DW_AT_name("SlWlanEventP2PConnect_t")
    7413                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$27)
    7414                            .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    7415                            .dwattr $C$DW$T$244, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7416                            .dwattr $C$DW$T$244, DW_AT_decl_line(0x261)
    7417                            .dwattr $C$DW$T$244, DW_AT_decl_column(0x03)
    7418                    
    7419                    
    7420                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7421                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x50)
    7422                    $C$DW$681       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  136

    7423                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$6)
    7424                            .dwattr $C$DW$681, DW_AT_name("Mode")
    7425                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("Mode")
    7426                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7427                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7428                            .dwattr $C$DW$681, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7429                            .dwattr $C$DW$681, DW_AT_decl_line(0x30f)
    7430                            .dwattr $C$DW$681, DW_AT_decl_column(0x09)
    7431                    
    7432                    $C$DW$682       .dwtag  DW_TAG_member
    7433                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$6)
    7434                            .dwattr $C$DW$682, DW_AT_name("ConnStatus")
    7435                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("ConnStatus")
    7436                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7437                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7438                            .dwattr $C$DW$682, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7439                            .dwattr $C$DW$682, DW_AT_decl_line(0x310)
    7440                            .dwattr $C$DW$682, DW_AT_decl_column(0x09)
    7441                    
    7442                    $C$DW$683       .dwtag  DW_TAG_member
    7443                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$6)
    7444                            .dwattr $C$DW$683, DW_AT_name("SecType")
    7445                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("SecType")
    7446                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7447                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7448                            .dwattr $C$DW$683, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7449                            .dwattr $C$DW$683, DW_AT_decl_line(0x311)
    7450                            .dwattr $C$DW$683, DW_AT_decl_column(0x09)
    7451                    
    7452                    $C$DW$684       .dwtag  DW_TAG_member
    7453                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$6)
    7454                            .dwattr $C$DW$684, DW_AT_name("Reserved")
    7455                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("Reserved")
    7456                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7457                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7458                            .dwattr $C$DW$684, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7459                            .dwattr $C$DW$684, DW_AT_decl_line(0x312)
    7460                            .dwattr $C$DW$684, DW_AT_decl_column(0x09)
    7461                    
    7462                    $C$DW$685       .dwtag  DW_TAG_member
    7463                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$28)
    7464                            .dwattr $C$DW$685, DW_AT_name("ConnectionInfo")
    7465                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("ConnectionInfo")
    7466                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7467                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7468                            .dwattr $C$DW$685, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7469                            .dwattr $C$DW$685, DW_AT_decl_line(0x313)
    7470                            .dwattr $C$DW$685, DW_AT_decl_column(0x1c)
    7471                    
    7472                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7473                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x30e)
    7474                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7475                            .dwendtag $C$DW$T$29
    7476                    
    7477                    $C$DW$T$564     .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  137

    7478                            .dwattr $C$DW$T$564, DW_AT_name("SlWlanConnStatusParam_t")
    7479                            .dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$29)
    7480                            .dwattr $C$DW$T$564, DW_AT_language(DW_LANG_C)
    7481                            .dwattr $C$DW$T$564, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7482                            .dwattr $C$DW$T$564, DW_AT_decl_line(0x314)
    7483                            .dwattr $C$DW$T$564, DW_AT_decl_column(0x02)
    7484                    
    7485                    
    7486                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7487                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    7488                    $C$DW$686       .dwtag  DW_TAG_member
    7489                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$14)
    7490                            .dwattr $C$DW$686, DW_AT_name("__max_align1")
    7491                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("__max_align1")
    7492                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7493                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7494                            .dwattr $C$DW$686, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7495                            .dwattr $C$DW$686, DW_AT_decl_line(0x7a)
    7496                            .dwattr $C$DW$686, DW_AT_decl_column(0x0c)
    7497                    
    7498                    $C$DW$687       .dwtag  DW_TAG_member
    7499                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$18)
    7500                            .dwattr $C$DW$687, DW_AT_name("__max_align2")
    7501                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("__max_align2")
    7502                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7503                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7504                            .dwattr $C$DW$687, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7505                            .dwattr $C$DW$687, DW_AT_decl_line(0x7b)
    7506                            .dwattr $C$DW$687, DW_AT_decl_column(0x0e)
    7507                    
    7508                            .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.
    7509                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x79)
    7510                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    7511                            .dwendtag $C$DW$T$30
    7512                    
    7513                    $C$DW$T$566     .dwtag  DW_TAG_typedef
    7514                            .dwattr $C$DW$T$566, DW_AT_name("__max_align_t")
    7515                            .dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$30)
    7516                            .dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
    7517                            .dwattr $C$DW$T$566, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4
    7518                            .dwattr $C$DW$T$566, DW_AT_decl_line(0x7c)
    7519                            .dwattr $C$DW$T$566, DW_AT_decl_column(0x03)
    7520                    
    7521                    
    7522                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7523                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    7524                    $C$DW$688       .dwtag  DW_TAG_member
    7525                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
    7526                            .dwattr $C$DW$688, DW_AT_name("hi")
    7527                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("hi")
    7528                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7529                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7530                            .dwattr $C$DW$688, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/Cl
    7531                            .dwattr $C$DW$688, DW_AT_decl_line(0x5c)
    7532                            .dwattr $C$DW$688, DW_AT_decl_column(0x0e)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  138

    7533                    
    7534                    $C$DW$689       .dwtag  DW_TAG_member
    7535                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    7536                            .dwattr $C$DW$689, DW_AT_name("lo")
    7537                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("lo")
    7538                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7539                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7540                            .dwattr $C$DW$689, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/Cl
    7541                            .dwattr $C$DW$689, DW_AT_decl_line(0x5d)
    7542                            .dwattr $C$DW$689, DW_AT_decl_column(0x0e)
    7543                    
    7544                            .dwattr $C$DW$T$33, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/C
    7545                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x5b)
    7546                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    7547                            .dwendtag $C$DW$T$33
    7548                    
    7549                    $C$DW$T$567     .dwtag  DW_TAG_typedef
    7550                            .dwattr $C$DW$T$567, DW_AT_name("ClockP_FreqHz")
    7551                            .dwattr $C$DW$T$567, DW_AT_type(*$C$DW$T$33)
    7552                            .dwattr $C$DW$T$567, DW_AT_language(DW_LANG_C)
    7553                            .dwattr $C$DW$T$567, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/
    7554                            .dwattr $C$DW$T$567, DW_AT_decl_line(0x5e)
    7555                            .dwattr $C$DW$T$567, DW_AT_decl_column(0x03)
    7556                    
    7557                    
    7558                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7559                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    7560                    $C$DW$690       .dwtag  DW_TAG_member
    7561                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$34)
    7562                            .dwattr $C$DW$690, DW_AT_name("startFlag")
    7563                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("startFlag")
    7564                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7565                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7566                            .dwattr $C$DW$690, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/Cl
    7567                            .dwattr $C$DW$690, DW_AT_decl_line(0x8d)
    7568                            .dwattr $C$DW$690, DW_AT_decl_column(0x0f)
    7569                    
    7570                    $C$DW$691       .dwtag  DW_TAG_member
    7571                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$32)
    7572                            .dwattr $C$DW$691, DW_AT_name("period")
    7573                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("period")
    7574                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7575                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7576                            .dwattr $C$DW$691, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/Cl
    7577                            .dwattr $C$DW$691, DW_AT_decl_line(0x8e)
    7578                            .dwattr $C$DW$691, DW_AT_decl_column(0x0f)
    7579                    
    7580                    $C$DW$692       .dwtag  DW_TAG_member
    7581                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$36)
    7582                            .dwattr $C$DW$692, DW_AT_name("arg")
    7583                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("arg")
    7584                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7585                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7586                            .dwattr $C$DW$692, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/Cl
    7587                            .dwattr $C$DW$692, DW_AT_decl_line(0x8f)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  139

    7588                            .dwattr $C$DW$692, DW_AT_decl_column(0x0f)
    7589                    
    7590                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/C
    7591                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x8c)
    7592                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    7593                            .dwendtag $C$DW$T$37
    7594                    
    7595                    $C$DW$T$568     .dwtag  DW_TAG_typedef
    7596                            .dwattr $C$DW$T$568, DW_AT_name("ClockP_Params")
    7597                            .dwattr $C$DW$T$568, DW_AT_type(*$C$DW$T$37)
    7598                            .dwattr $C$DW$T$568, DW_AT_language(DW_LANG_C)
    7599                            .dwattr $C$DW$T$568, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/dpl/
    7600                            .dwattr $C$DW$T$568, DW_AT_decl_line(0x90)
    7601                            .dwattr $C$DW$T$568, DW_AT_decl_column(0x03)
    7602                    
    7603                    
    7604                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7605                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    7606                    $C$DW$693       .dwtag  DW_TAG_member
    7607                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$8)
    7608                            .dwattr $C$DW$693, DW_AT_name("daylight")
    7609                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("daylight")
    7610                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7611                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7612                            .dwattr $C$DW$693, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7613                            .dwattr $C$DW$693, DW_AT_decl_line(0x9b)
    7614                            .dwattr $C$DW$693, DW_AT_decl_column(0x0b)
    7615                    
    7616                    $C$DW$694       .dwtag  DW_TAG_member
    7617                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$12)
    7618                            .dwattr $C$DW$694, DW_AT_name("timezone")
    7619                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("timezone")
    7620                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7621                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7622                            .dwattr $C$DW$694, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7623                            .dwattr $C$DW$694, DW_AT_decl_line(0x9c)
    7624                            .dwattr $C$DW$694, DW_AT_decl_column(0x0b)
    7625                    
    7626                    $C$DW$695       .dwtag  DW_TAG_member
    7627                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$39)
    7628                            .dwattr $C$DW$695, DW_AT_name("tzname")
    7629                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("tzname")
    7630                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7631                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7632                            .dwattr $C$DW$695, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7633                            .dwattr $C$DW$695, DW_AT_decl_line(0x9d)
    7634                            .dwattr $C$DW$695, DW_AT_decl_column(0x0b)
    7635                    
    7636                    $C$DW$696       .dwtag  DW_TAG_member
    7637                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$39)
    7638                            .dwattr $C$DW$696, DW_AT_name("dstname")
    7639                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("dstname")
    7640                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7641                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7642                            .dwattr $C$DW$696, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  140

    7643                            .dwattr $C$DW$696, DW_AT_decl_line(0x9e)
    7644                            .dwattr $C$DW$696, DW_AT_decl_column(0x0b)
    7645                    
    7646                            .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.
    7647                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x9a)
    7648                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    7649                            .dwendtag $C$DW$T$40
    7650                    
    7651                    $C$DW$T$569     .dwtag  DW_TAG_typedef
    7652                            .dwattr $C$DW$T$569, DW_AT_name("TZ")
    7653                            .dwattr $C$DW$T$569, DW_AT_type(*$C$DW$T$40)
    7654                            .dwattr $C$DW$T$569, DW_AT_language(DW_LANG_C)
    7655                            .dwattr $C$DW$T$569, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4
    7656                            .dwattr $C$DW$T$569, DW_AT_decl_line(0x9f)
    7657                            .dwattr $C$DW$T$569, DW_AT_decl_column(0x03)
    7658                    
    7659                    
    7660                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7661                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    7662                    $C$DW$697       .dwtag  DW_TAG_member
    7663                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$43)
    7664                            .dwattr $C$DW$697, DW_AT_name("pEntry")
    7665                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("pEntry")
    7666                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7667                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7668                            .dwattr $C$DW$697, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7669                            .dwattr $C$DW$697, DW_AT_decl_line(0x7c)
    7670                            .dwattr $C$DW$697, DW_AT_decl_column(0x16)
    7671                    
    7672                    $C$DW$698       .dwtag  DW_TAG_member
    7673                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$3)
    7674                            .dwattr $C$DW$698, DW_AT_name("pValue")
    7675                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("pValue")
    7676                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7677                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7678                            .dwattr $C$DW$698, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7679                            .dwattr $C$DW$698, DW_AT_decl_line(0x7d)
    7680                            .dwattr $C$DW$698, DW_AT_decl_column(0x0b)
    7681                    
    7682                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7683                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x7b)
    7684                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    7685                            .dwendtag $C$DW$T$44
    7686                    
    7687                    $C$DW$T$570     .dwtag  DW_TAG_typedef
    7688                            .dwattr $C$DW$T$570, DW_AT_name("tSimpleLinkSpawnMsg")
    7689                            .dwattr $C$DW$T$570, DW_AT_type(*$C$DW$T$44)
    7690                            .dwattr $C$DW$T$570, DW_AT_language(DW_LANG_C)
    7691                            .dwattr $C$DW$T$570, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7692                            .dwattr $C$DW$T$570, DW_AT_decl_line(0x7e)
    7693                            .dwattr $C$DW$T$570, DW_AT_decl_column(0x02)
    7694                    
    7695                    
    7696                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7697                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  141

    7698                    $C$DW$699       .dwtag  DW_TAG_member
    7699                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$10)
    7700                            .dwattr $C$DW$699, DW_AT_name("quot")
    7701                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("quot")
    7702                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7703                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7704                            .dwattr $C$DW$699, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7705                            .dwattr $C$DW$699, DW_AT_decl_line(0x4b)
    7706                            .dwattr $C$DW$699, DW_AT_decl_column(0x16)
    7707                    
    7708                    $C$DW$700       .dwtag  DW_TAG_member
    7709                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$10)
    7710                            .dwattr $C$DW$700, DW_AT_name("rem")
    7711                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("rem")
    7712                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7713                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7714                            .dwattr $C$DW$700, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7715                            .dwattr $C$DW$700, DW_AT_decl_line(0x4b)
    7716                            .dwattr $C$DW$700, DW_AT_decl_column(0x1c)
    7717                    
    7718                            .dwattr $C$DW$T$45, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.
    7719                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x4b)
    7720                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    7721                            .dwendtag $C$DW$T$45
    7722                    
    7723                    $C$DW$T$571     .dwtag  DW_TAG_typedef
    7724                            .dwattr $C$DW$T$571, DW_AT_name("div_t")
    7725                            .dwattr $C$DW$T$571, DW_AT_type(*$C$DW$T$45)
    7726                            .dwattr $C$DW$T$571, DW_AT_language(DW_LANG_C)
    7727                            .dwattr $C$DW$T$571, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4
    7728                            .dwattr $C$DW$T$571, DW_AT_decl_line(0x4b)
    7729                            .dwattr $C$DW$T$571, DW_AT_decl_column(0x23)
    7730                    
    7731                    
    7732                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7733                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x08)
    7734                    $C$DW$701       .dwtag  DW_TAG_member
    7735                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$10)
    7736                            .dwattr $C$DW$701, DW_AT_name("quot")
    7737                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("quot")
    7738                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7739                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7740                            .dwattr $C$DW$701, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7741                            .dwattr $C$DW$701, DW_AT_decl_line(0x50)
    7742                            .dwattr $C$DW$701, DW_AT_decl_column(0x16)
    7743                    
    7744                    $C$DW$702       .dwtag  DW_TAG_member
    7745                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$10)
    7746                            .dwattr $C$DW$702, DW_AT_name("rem")
    7747                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("rem")
    7748                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7749                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7750                            .dwattr $C$DW$702, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7751                            .dwattr $C$DW$702, DW_AT_decl_line(0x50)
    7752                            .dwattr $C$DW$702, DW_AT_decl_column(0x1c)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  142

    7753                    
    7754                            .dwattr $C$DW$T$46, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.
    7755                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x50)
    7756                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    7757                            .dwendtag $C$DW$T$46
    7758                    
    7759                    $C$DW$T$572     .dwtag  DW_TAG_typedef
    7760                            .dwattr $C$DW$T$572, DW_AT_name("ldiv_t")
    7761                            .dwattr $C$DW$T$572, DW_AT_type(*$C$DW$T$46)
    7762                            .dwattr $C$DW$T$572, DW_AT_language(DW_LANG_C)
    7763                            .dwattr $C$DW$T$572, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4
    7764                            .dwattr $C$DW$T$572, DW_AT_decl_line(0x50)
    7765                            .dwattr $C$DW$T$572, DW_AT_decl_column(0x23)
    7766                    
    7767                    
    7768                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7769                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    7770                    $C$DW$703       .dwtag  DW_TAG_member
    7771                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$14)
    7772                            .dwattr $C$DW$703, DW_AT_name("quot")
    7773                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("quot")
    7774                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7775                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7776                            .dwattr $C$DW$703, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7777                            .dwattr $C$DW$703, DW_AT_decl_line(0x58)
    7778                            .dwattr $C$DW$703, DW_AT_decl_column(0x1c)
    7779                    
    7780                    $C$DW$704       .dwtag  DW_TAG_member
    7781                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$14)
    7782                            .dwattr $C$DW$704, DW_AT_name("rem")
    7783                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("rem")
    7784                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7785                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7786                            .dwattr $C$DW$704, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.L
    7787                            .dwattr $C$DW$704, DW_AT_decl_line(0x58)
    7788                            .dwattr $C$DW$704, DW_AT_decl_column(0x22)
    7789                    
    7790                            .dwattr $C$DW$T$47, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4.
    7791                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x58)
    7792                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    7793                            .dwendtag $C$DW$T$47
    7794                    
    7795                    $C$DW$T$573     .dwtag  DW_TAG_typedef
    7796                            .dwattr $C$DW$T$573, DW_AT_name("lldiv_t")
    7797                            .dwattr $C$DW$T$573, DW_AT_type(*$C$DW$T$47)
    7798                            .dwattr $C$DW$T$573, DW_AT_language(DW_LANG_C)
    7799                            .dwattr $C$DW$T$573, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.4
    7800                            .dwattr $C$DW$T$573, DW_AT_decl_line(0x58)
    7801                            .dwattr $C$DW$T$573, DW_AT_decl_column(0x29)
    7802                    
    7803                    
    7804                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    7805                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x24)
    7806                    $C$DW$705       .dwtag  DW_TAG_member
    7807                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$9)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  143

    7808                            .dwattr $C$DW$705, DW_AT_name("Flags")
    7809                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("Flags")
    7810                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7811                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7812                            .dwattr $C$DW$705, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7813                            .dwattr $C$DW$705, DW_AT_decl_line(0x90)
    7814                            .dwattr $C$DW$705, DW_AT_decl_column(0x0b)
    7815                    
    7816                    $C$DW$706       .dwtag  DW_TAG_member
    7817                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$13)
    7818                            .dwattr $C$DW$706, DW_AT_name("Len")
    7819                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("Len")
    7820                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7821                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7822                            .dwattr $C$DW$706, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7823                            .dwattr $C$DW$706, DW_AT_decl_line(0x91)
    7824                            .dwattr $C$DW$706, DW_AT_decl_column(0x0b)
    7825                    
    7826                    $C$DW$707       .dwtag  DW_TAG_member
    7827                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$13)
    7828                            .dwattr $C$DW$707, DW_AT_name("MaxSize")
    7829                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("MaxSize")
    7830                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7831                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7832                            .dwattr $C$DW$707, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7833                            .dwattr $C$DW$707, DW_AT_decl_line(0x92)
    7834                            .dwattr $C$DW$707, DW_AT_decl_column(0x0b)
    7835                    
    7836                    $C$DW$708       .dwtag  DW_TAG_member
    7837                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$48)
    7838                            .dwattr $C$DW$708, DW_AT_name("Token")
    7839                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("Token")
    7840                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7841                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7842                            .dwattr $C$DW$708, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7843                            .dwattr $C$DW$708, DW_AT_decl_line(0x93)
    7844                            .dwattr $C$DW$708, DW_AT_decl_column(0x0b)
    7845                    
    7846                    $C$DW$709       .dwtag  DW_TAG_member
    7847                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$13)
    7848                            .dwattr $C$DW$709, DW_AT_name("StorageSize")
    7849                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("StorageSize")
    7850                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7851                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7852                            .dwattr $C$DW$709, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7853                            .dwattr $C$DW$709, DW_AT_decl_line(0x94)
    7854                            .dwattr $C$DW$709, DW_AT_decl_column(0x0b)
    7855                    
    7856                    $C$DW$710       .dwtag  DW_TAG_member
    7857                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$13)
    7858                            .dwattr $C$DW$710, DW_AT_name("WriteCounter")
    7859                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("WriteCounter")
    7860                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7861                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7862                            .dwattr $C$DW$710, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  144

    7863                            .dwattr $C$DW$710, DW_AT_decl_line(0x95)
    7864                            .dwattr $C$DW$710, DW_AT_decl_column(0x0b)
    7865                    
    7866                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7867                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x8f)
    7868                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    7869                            .dwendtag $C$DW$T$49
    7870                    
    7871                    $C$DW$T$574     .dwtag  DW_TAG_typedef
    7872                            .dwattr $C$DW$T$574, DW_AT_name("SlFsFileInfo_t")
    7873                            .dwattr $C$DW$T$574, DW_AT_type(*$C$DW$T$49)
    7874                            .dwattr $C$DW$T$574, DW_AT_language(DW_LANG_C)
    7875                            .dwattr $C$DW$T$574, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7876                            .dwattr $C$DW$T$574, DW_AT_decl_line(0x96)
    7877                            .dwattr $C$DW$T$574, DW_AT_decl_column(0x02)
    7878                    
    7879                    
    7880                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7881                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
    7882                    $C$DW$711       .dwtag  DW_TAG_member
    7883                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$48)
    7884                            .dwattr $C$DW$711, DW_AT_name("Key")
    7885                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("Key")
    7886                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7887                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7888                            .dwattr $C$DW$711, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7889                            .dwattr $C$DW$711, DW_AT_decl_line(0xb1)
    7890                            .dwattr $C$DW$711, DW_AT_decl_column(0x0b)
    7891                    
    7892                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7893                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xb0)
    7894                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    7895                            .dwendtag $C$DW$T$50
    7896                    
    7897                    $C$DW$T$575     .dwtag  DW_TAG_typedef
    7898                            .dwattr $C$DW$T$575, DW_AT_name("SlFsKey_t")
    7899                            .dwattr $C$DW$T$575, DW_AT_type(*$C$DW$T$50)
    7900                            .dwattr $C$DW$T$575, DW_AT_language(DW_LANG_C)
    7901                            .dwattr $C$DW$T$575, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7902                            .dwattr $C$DW$T$575, DW_AT_decl_line(0xb2)
    7903                            .dwattr $C$DW$T$575, DW_AT_decl_column(0x02)
    7904                    
    7905                    
    7906                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    7907                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    7908                    $C$DW$712       .dwtag  DW_TAG_member
    7909                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$6)
    7910                            .dwattr $C$DW$712, DW_AT_name("Index")
    7911                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("Index")
    7912                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7913                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7914                            .dwattr $C$DW$712, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7915                            .dwattr $C$DW$712, DW_AT_decl_line(0xb6)
    7916                            .dwattr $C$DW$712, DW_AT_decl_column(0x09)
    7917                    
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  145

    7918                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7919                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xb5)
    7920                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    7921                            .dwendtag $C$DW$T$51
    7922                    
    7923                    $C$DW$T$251     .dwtag  DW_TAG_typedef
    7924                            .dwattr $C$DW$T$251, DW_AT_name("SlFsFileNameIndex_t")
    7925                            .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$51)
    7926                            .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    7927                            .dwattr $C$DW$T$251, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7928                            .dwattr $C$DW$T$251, DW_AT_decl_line(0xb7)
    7929                            .dwattr $C$DW$T$251, DW_AT_decl_column(0x02)
    7930                    
    7931                    
    7932                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    7933                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    7934                    $C$DW$713       .dwtag  DW_TAG_member
    7935                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$13)
    7936                            .dwattr $C$DW$713, DW_AT_name("Operation")
    7937                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("Operation")
    7938                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7939                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7940                            .dwattr $C$DW$713, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7941                            .dwattr $C$DW$713, DW_AT_decl_line(0xca)
    7942                            .dwattr $C$DW$713, DW_AT_decl_column(0x08)
    7943                    
    7944                            .dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7945                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xc9)
    7946                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    7947                            .dwendtag $C$DW$T$52
    7948                    
    7949                    $C$DW$T$576     .dwtag  DW_TAG_typedef
    7950                            .dwattr $C$DW$T$576, DW_AT_name("SlFsRetToFactoryCommand_t")
    7951                            .dwattr $C$DW$T$576, DW_AT_type(*$C$DW$T$52)
    7952                            .dwattr $C$DW$T$576, DW_AT_language(DW_LANG_C)
    7953                            .dwattr $C$DW$T$576, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7954                            .dwattr $C$DW$T$576, DW_AT_decl_line(0xcb)
    7955                            .dwattr $C$DW$T$576, DW_AT_decl_column(0x02)
    7956                    
    7957                    
    7958                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7959                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    7960                    $C$DW$714       .dwtag  DW_TAG_member
    7961                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$13)
    7962                            .dwattr $C$DW$714, DW_AT_name("IncludeFilters")
    7963                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("IncludeFilters")
    7964                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7965                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7966                            .dwattr $C$DW$714, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7967                            .dwattr $C$DW$714, DW_AT_decl_line(0xd1)
    7968                            .dwattr $C$DW$714, DW_AT_decl_column(0x12)
    7969                    
    7970                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    7971                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xd0)
    7972                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  146

    7973                            .dwendtag $C$DW$T$53
    7974                    
    7975                    $C$DW$T$577     .dwtag  DW_TAG_typedef
    7976                            .dwattr $C$DW$T$577, DW_AT_name("SlFsControl_t")
    7977                            .dwattr $C$DW$T$577, DW_AT_type(*$C$DW$T$53)
    7978                            .dwattr $C$DW$T$577, DW_AT_language(DW_LANG_C)
    7979                            .dwattr $C$DW$T$577, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    7980                            .dwattr $C$DW$T$577, DW_AT_decl_line(0xd3)
    7981                            .dwattr $C$DW$T$577, DW_AT_decl_column(0x02)
    7982                    
    7983                    
    7984                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    7985                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    7986                    $C$DW$715       .dwtag  DW_TAG_member
    7987                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$9)
    7988                            .dwattr $C$DW$715, DW_AT_name("DeviceBlockSize")
    7989                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("DeviceBlockSize")
    7990                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7991                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7992                            .dwattr $C$DW$715, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    7993                            .dwattr $C$DW$715, DW_AT_decl_line(0xd7)
    7994                            .dwattr $C$DW$715, DW_AT_decl_column(0x08)
    7995                    
    7996                    $C$DW$716       .dwtag  DW_TAG_member
    7997                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$9)
    7998                            .dwattr $C$DW$716, DW_AT_name("DeviceBlocksCapacity")
    7999                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    8000                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8001                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8002                            .dwattr $C$DW$716, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8003                            .dwattr $C$DW$716, DW_AT_decl_line(0xd8)
    8004                            .dwattr $C$DW$716, DW_AT_decl_column(0x08)
    8005                    
    8006                    $C$DW$717       .dwtag  DW_TAG_member
    8007                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$9)
    8008                            .dwattr $C$DW$717, DW_AT_name("NumOfAllocatedBlocks")
    8009                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    8010                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8011                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8012                            .dwattr $C$DW$717, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8013                            .dwattr $C$DW$717, DW_AT_decl_line(0xd9)
    8014                            .dwattr $C$DW$717, DW_AT_decl_column(0x08)
    8015                    
    8016                    $C$DW$718       .dwtag  DW_TAG_member
    8017                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$9)
    8018                            .dwattr $C$DW$718, DW_AT_name("NumOfReservedBlocks")
    8019                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    8020                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8021                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8022                            .dwattr $C$DW$718, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8023                            .dwattr $C$DW$718, DW_AT_decl_line(0xda)
    8024                            .dwattr $C$DW$718, DW_AT_decl_column(0x08)
    8025                    
    8026                    $C$DW$719       .dwtag  DW_TAG_member
    8027                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$9)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  147

    8028                            .dwattr $C$DW$719, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    8029                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    8030                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8031                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8032                            .dwattr $C$DW$719, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8033                            .dwattr $C$DW$719, DW_AT_decl_line(0xdb)
    8034                            .dwattr $C$DW$719, DW_AT_decl_column(0x08)
    8035                    
    8036                    $C$DW$720       .dwtag  DW_TAG_member
    8037                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$9)
    8038                            .dwattr $C$DW$720, DW_AT_name("LargestAllocatedGapInBlocks")
    8039                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    8040                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8041                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8042                            .dwattr $C$DW$720, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8043                            .dwattr $C$DW$720, DW_AT_decl_line(0xdc)
    8044                            .dwattr $C$DW$720, DW_AT_decl_column(0x08)
    8045                    
    8046                    $C$DW$721       .dwtag  DW_TAG_member
    8047                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$9)
    8048                            .dwattr $C$DW$721, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    8049                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    8050                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8051                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8052                            .dwattr $C$DW$721, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8053                            .dwattr $C$DW$721, DW_AT_decl_line(0xdd)
    8054                            .dwattr $C$DW$721, DW_AT_decl_column(0x08)
    8055                    
    8056                    $C$DW$722       .dwtag  DW_TAG_member
    8057                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$54)
    8058                            .dwattr $C$DW$722, DW_AT_name("Padding")
    8059                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("Padding")
    8060                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8061                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8062                            .dwattr $C$DW$722, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8063                            .dwattr $C$DW$722, DW_AT_decl_line(0xde)
    8064                            .dwattr $C$DW$722, DW_AT_decl_column(0x08)
    8065                    
    8066                            .dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    8067                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xd6)
    8068                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    8069                            .dwendtag $C$DW$T$55
    8070                    
    8071                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    8072                            .dwattr $C$DW$T$57, DW_AT_name("SlFsControlDeviceUsage_t")
    8073                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$55)
    8074                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    8075                            .dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    8076                            .dwattr $C$DW$T$57, DW_AT_decl_line(0xdf)
    8077                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    8078                    
    8079                    
    8080                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    8081                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x14)
    8082                    $C$DW$723       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  148

    8083                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$6)
    8084                            .dwattr $C$DW$723, DW_AT_name("MaxFsFiles")
    8085                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("MaxFsFiles")
    8086                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8087                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8088                            .dwattr $C$DW$723, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8089                            .dwattr $C$DW$723, DW_AT_decl_line(0xe3)
    8090                            .dwattr $C$DW$723, DW_AT_decl_column(0x08)
    8091                    
    8092                    $C$DW$724       .dwtag  DW_TAG_member
    8093                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$6)
    8094                            .dwattr $C$DW$724, DW_AT_name("IsDevlopmentFormatType")
    8095                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    8096                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8097                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8098                            .dwattr $C$DW$724, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8099                            .dwattr $C$DW$724, DW_AT_decl_line(0xe4)
    8100                            .dwattr $C$DW$724, DW_AT_decl_column(0x08)
    8101                    
    8102                    $C$DW$725       .dwtag  DW_TAG_member
    8103                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$6)
    8104                            .dwattr $C$DW$725, DW_AT_name("Bundlestate")
    8105                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("Bundlestate")
    8106                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8107                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8108                            .dwattr $C$DW$725, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8109                            .dwattr $C$DW$725, DW_AT_decl_line(0xe5)
    8110                            .dwattr $C$DW$725, DW_AT_decl_column(0x08)
    8111                    
    8112                    $C$DW$726       .dwtag  DW_TAG_member
    8113                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$6)
    8114                            .dwattr $C$DW$726, DW_AT_name("Reserved")
    8115                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("Reserved")
    8116                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8117                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8118                            .dwattr $C$DW$726, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8119                            .dwattr $C$DW$726, DW_AT_decl_line(0xe6)
    8120                            .dwattr $C$DW$726, DW_AT_decl_column(0x08)
    8121                    
    8122                    $C$DW$727       .dwtag  DW_TAG_member
    8123                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$6)
    8124                            .dwattr $C$DW$727, DW_AT_name("MaxFsFilesReservedForSysFiles")
    8125                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    8126                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8127                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8128                            .dwattr $C$DW$727, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8129                            .dwattr $C$DW$727, DW_AT_decl_line(0xe7)
    8130                            .dwattr $C$DW$727, DW_AT_decl_column(0x08)
    8131                    
    8132                    $C$DW$728       .dwtag  DW_TAG_member
    8133                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$6)
    8134                            .dwattr $C$DW$728, DW_AT_name("ActualNumOfUserFiles")
    8135                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    8136                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8137                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  149

    8138                            .dwattr $C$DW$728, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8139                            .dwattr $C$DW$728, DW_AT_decl_line(0xe8)
    8140                            .dwattr $C$DW$728, DW_AT_decl_column(0x08)
    8141                    
    8142                    $C$DW$729       .dwtag  DW_TAG_member
    8143                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$6)
    8144                            .dwattr $C$DW$729, DW_AT_name("ActualNumOfSysFiles")
    8145                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    8146                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8147                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8148                            .dwattr $C$DW$729, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8149                            .dwattr $C$DW$729, DW_AT_decl_line(0xe9)
    8150                            .dwattr $C$DW$729, DW_AT_decl_column(0x08)
    8151                    
    8152                    $C$DW$730       .dwtag  DW_TAG_member
    8153                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$6)
    8154                            .dwattr $C$DW$730, DW_AT_name("Padding")
    8155                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("Padding")
    8156                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8157                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8158                            .dwattr $C$DW$730, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8159                            .dwattr $C$DW$730, DW_AT_decl_line(0xea)
    8160                            .dwattr $C$DW$730, DW_AT_decl_column(0x08)
    8161                    
    8162                    $C$DW$731       .dwtag  DW_TAG_member
    8163                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$13)
    8164                            .dwattr $C$DW$731, DW_AT_name("NumOfAlerts")
    8165                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("NumOfAlerts")
    8166                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8167                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8168                            .dwattr $C$DW$731, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8169                            .dwattr $C$DW$731, DW_AT_decl_line(0xeb)
    8170                            .dwattr $C$DW$731, DW_AT_decl_column(0x08)
    8171                    
    8172                    $C$DW$732       .dwtag  DW_TAG_member
    8173                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$13)
    8174                            .dwattr $C$DW$732, DW_AT_name("NumOfAlertsThreshold")
    8175                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    8176                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8177                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8178                            .dwattr $C$DW$732, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8179                            .dwattr $C$DW$732, DW_AT_decl_line(0xec)
    8180                            .dwattr $C$DW$732, DW_AT_decl_column(0x08)
    8181                    
    8182                    $C$DW$733       .dwtag  DW_TAG_member
    8183                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$9)
    8184                            .dwattr $C$DW$733, DW_AT_name("FATWriteCounter")
    8185                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("FATWriteCounter")
    8186                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8187                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8188                            .dwattr $C$DW$733, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8189                            .dwattr $C$DW$733, DW_AT_decl_line(0xed)
    8190                            .dwattr $C$DW$733, DW_AT_decl_column(0x08)
    8191                    
    8192                    $C$DW$734       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  150

    8193                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$9)
    8194                            .dwattr $C$DW$734, DW_AT_name("Padding2")
    8195                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("Padding2")
    8196                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8197                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8198                            .dwattr $C$DW$734, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8199                            .dwattr $C$DW$734, DW_AT_decl_line(0xee)
    8200                            .dwattr $C$DW$734, DW_AT_decl_column(0x08)
    8201                    
    8202                            .dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    8203                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe2)
    8204                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    8205                            .dwendtag $C$DW$T$56
    8206                    
    8207                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    8208                            .dwattr $C$DW$T$58, DW_AT_name("SlFsControlFilesUsage_t")
    8209                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$56)
    8210                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    8211                            .dwattr $C$DW$T$58, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    8212                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xef)
    8213                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x02)
    8214                    
    8215                    
    8216                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    8217                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x24)
    8218                    $C$DW$735       .dwtag  DW_TAG_member
    8219                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$57)
    8220                            .dwattr $C$DW$735, DW_AT_name("DeviceUsage")
    8221                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("DeviceUsage")
    8222                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8223                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8224                            .dwattr $C$DW$735, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8225                            .dwattr $C$DW$735, DW_AT_decl_line(0xf4)
    8226                            .dwattr $C$DW$735, DW_AT_decl_column(0x1e)
    8227                    
    8228                    $C$DW$736       .dwtag  DW_TAG_member
    8229                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$58)
    8230                            .dwattr $C$DW$736, DW_AT_name("FilesUsage")
    8231                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("FilesUsage")
    8232                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8233                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8234                            .dwattr $C$DW$736, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8235                            .dwattr $C$DW$736, DW_AT_decl_line(0xf5)
    8236                            .dwattr $C$DW$736, DW_AT_decl_column(0x1e)
    8237                    
    8238                            .dwattr $C$DW$T$59, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    8239                            .dwattr $C$DW$T$59, DW_AT_decl_line(0xf3)
    8240                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    8241                            .dwendtag $C$DW$T$59
    8242                    
    8243                    $C$DW$T$578     .dwtag  DW_TAG_typedef
    8244                            .dwattr $C$DW$T$578, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    8245                            .dwattr $C$DW$T$578, DW_AT_type(*$C$DW$T$59)
    8246                            .dwattr $C$DW$T$578, DW_AT_language(DW_LANG_C)
    8247                            .dwattr $C$DW$T$578, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  151

    8248                            .dwattr $C$DW$T$578, DW_AT_decl_line(0xf6)
    8249                            .dwattr $C$DW$T$578, DW_AT_decl_column(0x03)
    8250                    
    8251                    
    8252                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    8253                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x0c)
    8254                    $C$DW$737       .dwtag  DW_TAG_member
    8255                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$13)
    8256                            .dwattr $C$DW$737, DW_AT_name("IncludeFilters")
    8257                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("IncludeFilters")
    8258                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8259                            .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8260                            .dwattr $C$DW$737, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8261                            .dwattr $C$DW$737, DW_AT_decl_line(0xfa)
    8262                            .dwattr $C$DW$737, DW_AT_decl_column(0x0b)
    8263                    
    8264                    $C$DW$738       .dwtag  DW_TAG_member
    8265                            .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$6)
    8266                            .dwattr $C$DW$738, DW_AT_name("OpenedForWriteCnt")
    8267                            .dwattr $C$DW$738, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    8268                            .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8269                            .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8270                            .dwattr $C$DW$738, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8271                            .dwattr $C$DW$738, DW_AT_decl_line(0xfb)
    8272                            .dwattr $C$DW$738, DW_AT_decl_column(0x0b)
    8273                    
    8274                    $C$DW$739       .dwtag  DW_TAG_member
    8275                            .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$6)
    8276                            .dwattr $C$DW$739, DW_AT_name("OpeneForReadCnt")
    8277                            .dwattr $C$DW$739, DW_AT_TI_symbol_name("OpeneForReadCnt")
    8278                            .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8279                            .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8280                            .dwattr $C$DW$739, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8281                            .dwattr $C$DW$739, DW_AT_decl_line(0xfc)
    8282                            .dwattr $C$DW$739, DW_AT_decl_column(0x0b)
    8283                    
    8284                    $C$DW$740       .dwtag  DW_TAG_member
    8285                            .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$6)
    8286                            .dwattr $C$DW$740, DW_AT_name("ClosedFilesCnt")
    8287                            .dwattr $C$DW$740, DW_AT_TI_symbol_name("ClosedFilesCnt")
    8288                            .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8289                            .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8290                            .dwattr $C$DW$740, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8291                            .dwattr $C$DW$740, DW_AT_decl_line(0xfd)
    8292                            .dwattr $C$DW$740, DW_AT_decl_column(0x0b)
    8293                    
    8294                    $C$DW$741       .dwtag  DW_TAG_member
    8295                            .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$6)
    8296                            .dwattr $C$DW$741, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    8297                            .dwattr $C$DW$741, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    8298                            .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8299                            .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8300                            .dwattr $C$DW$741, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8301                            .dwattr $C$DW$741, DW_AT_decl_line(0xfe)
    8302                            .dwattr $C$DW$741, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  152

    8303                    
    8304                    $C$DW$742       .dwtag  DW_TAG_member
    8305                            .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$6)
    8306                            .dwattr $C$DW$742, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    8307                            .dwattr $C$DW$742, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    8308                            .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8309                            .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8310                            .dwattr $C$DW$742, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8311                            .dwattr $C$DW$742, DW_AT_decl_line(0xff)
    8312                            .dwattr $C$DW$742, DW_AT_decl_column(0x0b)
    8313                    
    8314                    $C$DW$743       .dwtag  DW_TAG_member
    8315                            .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$6)
    8316                            .dwattr $C$DW$743, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    8317                            .dwattr $C$DW$743, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    8318                            .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8319                            .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8320                            .dwattr $C$DW$743, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8321                            .dwattr $C$DW$743, DW_AT_decl_line(0x100)
    8322                            .dwattr $C$DW$743, DW_AT_decl_column(0x0b)
    8323                    
    8324                    $C$DW$744       .dwtag  DW_TAG_member
    8325                            .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
    8326                            .dwattr $C$DW$744, DW_AT_name("padding")
    8327                            .dwattr $C$DW$744, DW_AT_TI_symbol_name("padding")
    8328                            .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8329                            .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8330                            .dwattr $C$DW$744, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8331                            .dwattr $C$DW$744, DW_AT_decl_line(0x101)
    8332                            .dwattr $C$DW$744, DW_AT_decl_column(0x0b)
    8333                    
    8334                            .dwattr $C$DW$T$60, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/w
    8335                            .dwattr $C$DW$T$60, DW_AT_decl_line(0xf9)
    8336                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    8337                            .dwendtag $C$DW$T$60
    8338                    
    8339                    $C$DW$T$579     .dwtag  DW_TAG_typedef
    8340                            .dwattr $C$DW$T$579, DW_AT_name("SlFsControlGetCountersResponse_t")
    8341                            .dwattr $C$DW$T$579, DW_AT_type(*$C$DW$T$60)
    8342                            .dwattr $C$DW$T$579, DW_AT_language(DW_LANG_C)
    8343                            .dwattr $C$DW$T$579, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/
    8344                            .dwattr $C$DW$T$579, DW_AT_decl_line(0x102)
    8345                            .dwattr $C$DW$T$579, DW_AT_decl_column(0x03)
    8346                    
    8347                    
    8348                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    8349                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x0c)
    8350                    $C$DW$745       .dwtag  DW_TAG_member
    8351                            .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$13)
    8352                            .dwattr $C$DW$745, DW_AT_name("FileMaxSize")
    8353                            .dwattr $C$DW$745, DW_AT_TI_symbol_name("FileMaxSize")
    8354                            .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8355                            .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8356                            .dwattr $C$DW$745, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8357                            .dwattr $C$DW$745, DW_AT_decl_line(0x111)
TI ARM Assembler Unix v18.12.4 Mon Jan 27 17:24:52 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  153

    8358                            .dwattr $C$DW$745, DW_AT_decl_column(0x0a)
    8359                    
    8360                    $C$DW$746       .dwtag  DW_TAG_member
    8361                            .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$13)
    8362                            .dwattr $C$DW$746, DW_AT_name("Properties")
    8363                            .dwattr $C$DW$746, DW_AT_TI_symbol_name("Properties")
    8364                            .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8365                            .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8366                            .dwattr $C$DW$746, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8367                            .dwattr $C$DW$746, DW_AT_decl_line(0x112)
    8368                            .dwattr $C$DW$746, DW_AT_decl_column(0x0a)
    8369                    
    8370                    $C$DW$747       .dwtag  DW_TAG_member
    8371                            .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$13)
    8372                            .dwattr $C$DW$747, DW_AT_name("FileAllocatedBlocks")
    8373                            .dwattr $C$DW$747, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    8374                            .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8375                            .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8376                            .dwattr $C$DW$747, DW_AT_decl_file("/vagrant/Q4_ENG_20.10.19/sdk_root/source/ti/drivers/net/wi
    8377                            .dwattr $C$DW$747, DW_AT_decl_line(0x113)
    8378                            .dwattr $C$DW$747, DW_AT_decl_column(0x0a)
    8379                    
